# 1.0 IMPORTANDO OS DADOS

In [ ]:
# IMPORTANDO BIBLIOTECAS E CONECTANDO O BANCO DE DADOS

import sqlite3
import pandas as pd
 
conn = sqlite3.connect('database.db')

In [14]:
# TABELA COM TODAS AS COLUNAS
consulta_total = 'SELECT * FROM flight_activity LIMIT 5'
df_atividade = pd.read_sql_query(consulta_total, conn)
df_atividade.head()

,loyalty_number,year,month,flights_booked,flights_with_companions,total_flights,distance,points_accumulated,points_redeemed,dollar_cost_points_redeemed
0,100018,2017,1,3,0,3,1521,152.0,0,0
1,100102,2017,1,10,4,14,2030,203.0,0,0
2,100140,2017,1,6,0,6,1200,120.0,0,0
3,100214,2017,1,0,0,0,0,0.0,0,0
4,100272,2017,1,0,0,0,0,0.0,0,0

In [16]:
# CONSULTA NO BANCO DE DADOS E UNINDO TABELAS
consulta_atividade = """

    SELECT
        *
    FROM flight_activity AS fa LEFT JOIN flight_loyalty_history AS flh
    ON (fa.loyalty_number = flh.loyalty_number)

"""

df_atividade = pd.read_sql_query(consulta_atividade, conn)
df_atividade.head()

,loyalty_number,year,month,flights_booked,flights_with_companions,total_flights,distance,points_accumulated,points_redeemed,dollar_cost_points_redeemed,...,education,salary,marital_status,loyalty_card,clv,enrollment_type,enrollment_year,enrollment_month,cancellation_year,cancellation_month
0,100018,2017,1,3,0,3,1521,152.0,0,0,...,Bachelor,92552.0,Married,Aurora,7919.20,Standard,2016,8,NaN,NaN
1,100102,2017,1,10,4,14,2030,203.0,0,0,...,College,NaN,Single,Nova,2887.74,Standard,2013,3,NaN,NaN
2,100140,2017,1,6,0,6,1200,120.0,0,0,...,College,NaN,Divorced,Nova,2838.07,Standard,2016,7,NaN,NaN
3,100214,2017,1,0,0,0,0,0.0,0,0,...,Bachelor,63253.0,Married,Star,4170.57,Standard,2015,8,NaN,NaN
4,100272,2017,1,0,0,0,0,0.0,0,0,...,Bachelor,91163.0,Divorced,Star,6622.05,Standard,2014,1,NaN,NaN

# 2.0 EXERCICIOS:

In [ ]:
# Selecione as colunas: loyalty_number, year, month, flights_booked, total_flights, distance e points_accumulated 

consulta_atividade = """

    SELECT
        fa.loyalty_number,
        fa.year,
        fa.month,
        fa.flights_booked,
        fa.total_flights,
        fa.distance,
        fa.points_accumulated
    FROM flight_activity as fa

"""

df_atividade = pd.read_sql_query(consulta_atividade, conn)
display(df_atividade)

In [ ]:
#Selecione as mesmas colunas, porém, recupere somente as linhas cuja coluna distance é maior do que 2000

consulta_atividade = """

    SELECT
        fa.loyalty_number,
        fa.year,
        fa.month,
        fa.flights_booked,
        fa.total_flights,
        fa.distance,
        fa.points_accumulated
    FROM flight_activity as fa
    WHERE distance > 2000

"""

df_atividade = pd.read_sql_query(consulta_atividade, conn)
display(df_atividade)

In [ ]:
#Selecione as mesmas colunas, porém, recupere somente as linhas cuja coluna distance é maior do que 2000 e a coluna month é igual a 9

consulta_atividade = """

    SELECT
        fa.loyalty_number,
        fa.year,
        fa.month,
        fa.flights_booked,
        fa.total_flights,
        fa.distance,
        fa.points_accumulated
    FROM flight_activity as fa
    WHERE distance > 2000 AND month = 9

"""

df_atividade = pd.read_sql_query(consulta_atividade, conn)
display(df_atividade)

In [ ]:
#Selecione as colunas: loyalty_number, country, city, gender e loyalty_card, salary da tabela “flight_loyalty_history”. 
consulta_atividade = """

    SELECT
        flh.loyalty_number,
        flh.country,
        flh.city, 
        flh.gender,
        flh.loyalty_card
    FROM flight_loyalty_history as flh

"""

df_atividade = pd.read_sql_query(consulta_atividade, conn)
display(df_atividade)

In [ ]:
# Selecione as mesmas colunas, porém, recupere somente as linhas cuja coluna gender é igual a Female
consulta_atividade = """

    SELECT
        flh.loyalty_number,
        flh.country,
        flh.city, 
        flh.gender,
        flh.loyalty_card
    FROM flight_loyalty_history as flh
    WHERE flh.gender = 'Female'
"""

df_atividade = pd.read_sql_query(consulta_atividade, conn)
display(df_atividade)

# 3.0 INSPECIONANDO OS DADOS

In [18]:
# Verificando o numero de linha e colunas da tabela

df_atividade.shape[0]

405624